app/views/shared/_navbar.html.erb

SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = ? ORDER BY "cats"."id" ASC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
      <% if user.present? %>
        <% cat = user.cats.first %>