app/views/home/index.html.erb

SELECT "cats"."id" FROM "cats"
---
    <% else %>
      You've rated <%= pluralize(@user.cats_rated.count, "cat") %>! You can <%= link_to "view your past ratings here" %>