app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("name", "age", "breed", "bio", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Fig"], ["age", "7"], ["breed", ""], ["bio", ""], ["image", "#<ActionDispatch::Http::UploadedFile:0x1284c810>"], ["user_id", 2]]

  def edit
    @cat = Cat.where(id: params[:id]).first
    @user = current_user
    if @user.blank?
      flash[:alert] = "You must sign-in to create or edit cat profiles."
      redirect_to root_path and return
    elsif @cat.blank? || @user.id != @cat.user_id
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? ORDER BY "cats"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = ? ORDER BY "cats"."id" ASC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @cat = Cat.where(id: params[:id]).first
    @cat.attributes = cat_params
    if @cat.save
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? ORDER BY "cats"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "bio" = ?, "image" = ? WHERE "cats"."id" = ?  [["bio", "This cat isn't special."], ["image", "test.jpg"], ["id", 1]]

  def create_rating
    rating = params[:rating].to_i
    error = nil
    @user = current_user
    if rating > 0
      if !@user.cats_rated.include?(params[:cat_id].to_i)
        rating = Rating.new(user_id: params[:user_id], cat_id: params[:cat_id], rating: params[:rating])
        @user.cats_rated << params[:cat_id]
        @user.save
      else
        error = "You\\'ve rated all available cats!"
      end
    else
      error = "Please select a rating"
    end
    cat_ids = Cat.all.pluck(:id) - @user.cats_rated
    @cat = Cat.where(id: cat_ids[rand(cat_ids.length)]).first
    respond_to do |format|
      if error
         format.js { render :js => "$('#rating_error').text('#{error}');" and return }
      elsif rating.save
---
SELECT "cats"."id" FROM "cats"
UPDATE "users" SET "cats_rated" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["cats_rated", "{2}"], ["updated_at", "2018-04-03 01:04:57.209175"], ["id", 3]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 ORDER BY "cats"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "ratings" ("user_id", "cat_id", "rating") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 3], ["cat_id", 2], ["rating", 6]]