app/controllers/home_controller.rb

SELECT "cats"."id" FROM "cats"
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? ORDER BY "cats"."id" ASC LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def index
    cat_ids = Cat.all.pluck(:id)
    @cat = Cat.where(id: cat_ids[rand(cat_ids.length)]).first